{
  "general_info": {
    "established": "FISAT was established in 2002.",
    "motto": "The college's motto is 'Focus on Excellence'.",
    "vision": "To become a world-class professional institute with a focus on excellence, molding committed global professionals.",
    "mission": "To provide advanced technical education and transform students into industry-ready professionals."
  },

  "campuslocation": {
    "location": "FISAT is located at Hormis Nagar, Mookkannoor, Angamaly, Kerala."
  },

  "admissions": {
    "procedures": "Admissions at FISAT are based on merit and entrance exams like KEAM. Visit the official website for details."
  },

  "fees": {
    "structure": "The fee structure varies by program. BTech fees are approximately ₹75,000 per semester."
  },

  "programs": {
    "BTech": "FISAT offers BTech programs in CSE, ECE, EEE, ME, Civil, etc.",
    "MTech": "MTech specializations include AI & Data Science, VLSI, Structural Engineering, etc.",
    "MBA": "MBA is offered with specializations in Finance, Marketing, HR, etc.",
    "MCA": "MCA program with integrated options is available.",
    "PhD": "Doctoral programs are available in various fields."
  },

  "faculty": {
    "HOD": "HODs include Dr. S Krishna Kumar (ECE), Dr. Jiji Antony (Civil), Dr. Abi P Mathew (EIE), etc."
  },

  "facilities": {
    "hostel": "Separate hostels for boys and girls with study rooms and WiFi.",
    "library": "Library has 50,000+ books and research journals.",
    "sports": "Sports facilities include a gymnasium and a stadium.",
    "canteen": "A hygienic canteen with multiple food options is available."
  },

  "events": {
    "ICEFOSS": "ICEFOSS is a Free and Open Source Software (FOSS) event with hackathons and expert talks.",
    "tech_fests": "Tech fests focus on innovation, workshops, and competitions.",
    "cultural_fests": "Cultural fests include music, dance, and creative events."
  },

  "placementoverview": {
    "placements": "FISAT has an excellent placement record, with top recruiters visiting annually.",
    "recruiters": "Companies like IBM, TCS, Infosys, Wipro, and Accenture recruit from FISAT."
  },

  "contact": {
    "details": "Email: admission@fisat.ac.in | Phone: +91 1234567890",
    "website": "Visit https://fisat.ac.in for more information."
  }
}